Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་ཤེས་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། ཡེ་ཤེས་ཆགས་པ་མེད་པ་དང་། ཅིའང་རུང་སྟེ། དེ་ཐམས་ཅད་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱེད་དུ་བཅུག་པ་ལས་གྱུར་པར་བལྟའོ།
en: Śāriputra, based on this teaching, you should understand the following: know that the Thus-Gone One’s awakened greatness, his ten strengths, his fearlessness, his unobstructed wisdom, and all other such qualities appeared due to Mañjuśrī Kumārabhūta’s doing!

source: སེམས་བསྐྱེད་པ་དེ་ལས་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་པའི་ཕྱིར་རོ།
en: Because my omniscience was attained on the basis of that mind of awakening. “

source: །ཤཱ་རིའི་བུ་ངས་ནི་ཕྱོགས་བཅུ་ན་ང་བདག་ཅི་ལྟ་བ་དེ་དང་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་གང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་ལ་བཞག་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དང་། དེ་བཞིན་དུ་ཏི་ཤ་ཞེས་བྱ་བ་དང་། རྒྱལ་བ་ཞེས་བྱ་བ་དང་། གཙུག་ལྡན་ཞེས་བྱ་བ་དང་། མར་མེ་མཛད་ཅེས་བྱ་བ་དག་མཐོང་སྟེ།
en: Śāriputra, throughout the ten directions I have seen countless thus-gone ones like myself named Śākyamuni—and also thus-gone ones named Tiṣya, Jina, Śikhin, and Dīpaṅkara—who Mañjuśrī Kumārabhūta established in awakening.

source: གང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་ལ་བཞག་ནས་ད་ལྟར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་ཀྱང་བསྐལ་པའམ། བསྐལ་པའི་ལྷག་མ་མ་ལུས་པར་བརྗོད་པར་གྱུར་ན་གང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་དག་ལྟ་ཅི་སྨོས། གང་དགའ་ལྡན་གྱི་གནས་ན་གནས་པ་དག་ལྟ་ཅི་སྨོས། གང་སྐྱེ་བ་དག་ལྟ་ཅི་སྨོས། གང་ཁྱིམ་ནས་འབྱུང་བ་དག་ལྟ་ཅི་སྨོས། གང་དཀའ་བ་སྤྱོད་པ་དག་ལྟ་ཅི་སྨོས། གང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དག་ལྟ་ཅི་སྨོས་ཏེ།
en: If it would take an eon or more to simply speak the names of the thus-gone ones established in awakening by Mañjuśrī Kumārabhūta, who presently turn the wheel of Dharma, how much more to speak of their bodhisattva conduct, their abiding in the Heaven of Joy, their taking birth, their departure from the household, their austerities, or their presence at the Seat of Awakening? “

source: ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གང་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མའོ། །སྐྱེད་པའོ། །ཐུགས་རྗེ་བའོ། །བྱེད་དུ་འཇུག་པའོ་ཞེས་ཡང་དག་པར་སྨྲ་ཞིང་སྟོན་པ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཉིད་ལ་དེ་དག་སྨྲ་ཞིང་སྟོན་ཏེ།
en: Śāriputra, based on this teaching, you should understand the following: When declaring and identifying the mother of all bodhisattvas, as well as their engendering, their compassion, and their encouragement, these are all to be named and identified precisely on Mañjuśrī Kumārabhūta himself.

source: ཤཱ་རིའི་བུ་རྒྱུ་དེ་དང་རྐྱེན་དེ་ཡིན་ཏེ། སྔོན་ཕན་བཏགས་པའི་ཕྱིར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ང་ལ་བྱས་པ་མི་གཟོ་བས་རྒོལ་ལོ།
en: Śāriputra, these are the causes and conditions that explain why I was in error when I failed to appreciate how Mañjuśrī Kumārabhūta had benefitted me in the past.

source: །དེ་ནས་ལྷའི་བུ་ཉིས་བརྒྱ་པོ་དག་འདི་སྙམ་དུ་གྱུར་ཏེ། ཆོས་ཐམས་ཅད་ནི་རྒྱུའི་རྗེས་སུ་འགྲོ་བའོ། །རྐྱེན་ལ་རག་ལས་པའོ། །སྲེད་པའི་རྩ་བ་ཅན་ནོ། །སྨོན་ལམ་གྱིས་ཐོག་དྲངས་པ་ཅན་ཡིན་ཏེ།
en: Then two hundred gods thought, “All phenomena appear from causes, depend on conditions, are rooted in craving, and are guided by aspiration.

source: བཅོམ་ལྡན་འདས་འདི་ཡང་གཞན་གྱིས་བྱེད་དུ་བཅུག་པ་ཡིན་ན་དེ་བཞིན་གཤེགས་པ་མངོན་པར་བཞུགས་བཞིན་དུ་བདག་ཅག་དམན་པ་ལ་སེམས་པ་དེ་ནི་མི་རིགས་སོ་སྙམ་མོ།
en: So, even though the Blessed One may have been encouraged by someone else, it would not be appropriate for us to be concerned with someone inferior now that the Thus-Gone One is actually present here.”

source: །དེ་ནས་ལྷའི་བུ་ཉིས་བརྒྱ་པོ་དེ་དག་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Then these two hundred gods developed with an altruistic intention the mind directed toward unsurpassed and perfect awakening.

source: །འདིར་ལག་པ་བརྐྱང་ཞིང་རྫུ་འཕྲུལ་བསྟན་པའི་ཆོ་འཕྲུལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བསྟན་ཅིང་ལྷུང་བཟེད་བླངས་པ་དང་། འདི་ལ་སྔོན་བྱུང་བའི་ཆོས་བསྟན་པ་བསྟན་པའི་ཚེ་འོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། འདི་ནས་སེམས་ཅན་གྲངས་ལས་འདས་པས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When Mañjuśrī Kumārabhūta extended his hand and displayed miracles as he picked up the alms bowl, and when this Dharma teaching of past events was told, countless beings from buddha realms in the lower direction developed the mind directed toward awakening.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་ནས་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པའི་ལས་བྱ་བ་དང་། ཆོས་ཀྱི་གཡོག་བྱ་བའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་རིན་པོ་ཆེའི་གདུགས་བསྐུར་བར་གྱུར་ཏེ།
en: Blessed buddhas from limitless buddha realms throughout the ten directions presented jeweled parasols to Mañjuśrī Kumārabhūta in order to venerate him and shelter the Dharma.

source: རིན་པོ་ཆེའི་གདུགས་དེ་དག་གིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁེབས་པར་གྱུར་ཏོ།
en: These jeweled parasols covered this world.

source: །རིན་པོ་ཆེའི་གདུགས་དེ་ལས་ཀྱང་དེ་བཞིན་ནོ། །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གསུངས་པ་བཞིན་ཏེ། བདག་ཅག་ཐམས་ཅད་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་ལ་བཀོད་དོ་ཞེས་དེ་སྐད་ཟེར་བའི་སྒྲ་བྱུང་ངོ་།
en: From the jeweled parasols, the following sound resounded: “Just as the thus-gone Śākyamuni has said, all of us were established in awakening by Mañjuśrī Kumārabhūta.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་མྱུར་དུ་མྱ་ངན་ལས་འདའ་བར་འདོད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: The Blessed One then said to venerable Śāriputra, “Śāriputra, those who desire to reach nirvāṇa swiftly should develop the mind directed toward unsurpassed and perfect awakening.

source: ཤཱ་རིའི་བུ་སེམས་ཅན་གང་འཁོར་བས་སྐྲག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་སྐྱེད་ཅིང་།
en: Śāriputra, having become afraid of saṃsāra, a being does not cultivate a mind set on unsurpassed and perfect awakening.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་གནས་ལ་ཉན་ཐོས་སུ་འགྱུར་བར་བྱའོ་སྙམ་དུ་སེམས་པ་དེ་དག་ནི་ད་དུང་དུའང་འཁོར་བ་ན་འཁོར་བར་གྱུར་ལ།
en: Rather, that person becomes a hearer and remains in the vehicle of the hearers. That will ensure that they continue to cycle in saṃsāra.

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་པ་དག་གིས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཐོབ་པར་ངས་མཐོང་ངོ་།
en: On the other hand, I have seen that other bodhisattvas who are diligent and abide in perfect awakening do in fact gain omniscience.

source: །ཤཱ་རིའི་བུ་སྔོན་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱ་བ་རིག་པ་དང་རྐང་པར་ལྡན་པ།
en: Śāriputra, long ago, a thus-gone, worthy, perfect buddha named He Who Outshines All appeared in the world.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ཏེ།
en: He was someone learned and virtuous, a well-gone one, a knower of the world, a charioteer who guides beings, an unsurpassed being, a teacher of gods and humans, and a blessed buddha.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་ཉན་ཐོས་ནི་བྱེ་བ་ཕྲག་བརྒྱ་ཡོད་པར་གྱུར་ཏོ། །ཚེའི་ཚད་ནི་ལོ་འབུམ་ཐུབ་པར་གྱུར་ཏོ།
en: Śāriputra, this thus-gone one’s hearers numbered one billion, and his lifespan reached a hundred thousand years.

source: །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་ཉན་ཐོས་ཀྱི་མཆོག་ཤེས་རབ་དང་ལྡན་པ་ནི་དགེ་སློང་མངོན་པར་འཕགས་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: Śāriputra, the greatest of this thus-gone one’s hearers, in terms of insight, was the monk Exalted.

source: །ཉན་ཐོས་ཀྱི་མཆོག་གཉིས་པ་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ནི་ཤུགས་ཆེན་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །དེ་ལྟ་སྟེ།
en: The second greatest of his hearers, in terms of miraculous abilities, was the monk Powerful. “

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཤམ་ཐབས་མནབས་ཆོས་གོས་དང་། ལྷུང་བཟེད་བསྣམས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས་རྒྱལ་པོའི་ཕོ་བྲང་གྲགས་ལྡན་ཞེས་བྱ་བར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་སོ།
en: Śāriputra, one morning the Thus-Gone One donned his lower garment and Dharma robes, picked up his alms bowl, and, attended on by his saṅgha of hearers, set out for the royal palace called Famous to collect alms.

source: །དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པའི་གཡས་ཕྱོགས་ནས་ནི་ཉན་ཐོས་ཤེས་རབ་དང་ལྡན་པའི་མཆོག་འགྲོའོ། །གཡོན་ཕྱོགས་ནས་ནི་ཉན་ཐོས་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་འགྲོའོ།
en: On that occasion, on his right side went his hearer with the greatest insight, and on his left side went his hearer with the greatest miraculous abilities.

source: །རྒྱབ་ནས་ནི་མང་དུ་ཐོས་པ་འགྲོའོ།
en: Many other learned ones followed them.

source: །མདུན་ནས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་སྟོང་འགྲོ་སྟེ།
en: Eight thousand bodhisattvas preceded them.

source: ལ་ལ་ནི་ཚངས་པའི་གཟུགས། ལ་ལ་ནི་བརྒྱ་བྱིན་གྱི་གཟུགས། ལ་ལ་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཟུགས། ལ་ལ་ནི་ལྷའི་གཟུགས་ཀྱིས་ལམ་གྱི་བྱི་དོར་བྱེད་ཅིང་འགྲོ་སྟེ།
en: With some bodhisattvas assuming the appearance of Brahmā, some of Śakra, some of the Four Great Kings, and some of gods, they went ahead, sweeping the road. “

source: ཤཱ་རིའི་བུ་དེའི་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་དེ་རྒྱལ་པོའི་ཕོ་བྲང་དེར་གཤེགས་པ་དང་། བྱིས་པ་རྒྱན་བཟང་པོས་བརྒྱན་པ་གསུམ་ཞིག་ལམ་གྱི་བར་ན་རྩེ་ཞིང་འདུག་པ་ལས་བྱིས་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་བཟང་བ།
en: Śāriputra, as this thus-gone one was approaching the palace, there were three well-adorned children playing alongside the road. The children noticed the Thus-Gone One proceeding at a distance.

source: སེམས་དད་པར་འགྱུར་བ། དབང་པོ་ཞི་བ།
en: They saw that he was fine and pure minded, with peaceful faculties and a peaceful mind.

source: ཡིད་ཞི་བ། དུལ་བ་དང་ཞི་གནས་མཆོག་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: He was gentle and had perfected the highest form of tranquility.

source: སྐྱོན་མེད་པ། དབང་པོ་ཐུལ་བ།
en: He was flawless and had tamed his faculties.

source: རྫིང་བཞིན་དུ་དང་ལ་གསལ་ཞིང་རྙོག་པ་མེད་པ།
en: He was limpid, clear, and pristine like a pond.

source: མཆོད་སྦྱིན་གྱི་ཤིང་གསེར་ལས་བྱས་པ་ལྟར་མངོན་པར་འཕགས་པ་འབར་བ་མཛེས་པ། ལྷམ་མེ་ལྷན་ནེར་བཞུགས་པ།
en: He was exalted, radiant, beautiful, dazzling, and shining like a golden tree of worship.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ་དེ་རྒྱང་མ་ནས་གཤེགས་པ་མཐོང་ངོ་།
en: He was adorned by the thirty-two major marks of a great being. “

source: །མཐོང་ནས་ཁྱེའུ་གཅིག་གིས་ཁྱེའུ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེའུ་ཁྱེད་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་བསོད་ནམས་ཀྱི་ཞིང་བླ་ན་མེད་པ་ལྷ་དང་མིའི་འཇིག་རྟེན་དུ་བཅས་པའི་སྦྱིན་པའི་གནས་དེ་གཤེགས་པ་མཐོང་ངམ།
en: In seeing this, one child asked the others, ‘Do you see the Thus-Gone One, this highest of all beings, the unsurpassed field of merit, the worthy recipient of the offerings of the world with its gods and humans?

source: ཚུར་ཤོག་དེ་ལ་མཆོད་པ་བྱའོ།
en: Come, let’s venerate him.

source: །འདི་ལ་ཕུལ་ན་འབྲས་བུ་ཆེན་པོར་འགྱུར་རོ།
en: For great results will come from making an offering to him.’ “

source: །དེ་ནས་དེའི་ཚེ་ཁྱེའུ་དེས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །འདི་ནི་སེམས་ཅན་ཀུན་གྱི་མཆོག །སྦྱིན་གནས་བླ་ན་མེད་པ་སྟེ།
en: The child then spoke the following verse: “ ‘This is the greatest of beings— The unsurpassed and worthy recipient of offerings.

source: །དེ་བས་འདི་ལ་མཆོད་པར་བྱ།
en: Thus, we should venerate him.

source: །འདི་མཆོད་འབྲས་བུ་ཆེན་པོར་འགྱུར།
en: Venerating him will bring great results.’ “

source: །ཁྱེའུ་གཉིས་པོས་སྨྲས་པ། བདག་ཅག་ལ་ནི་མེ་ཏོག་དང་། །དྲི་དང་ཕྱེ་མ་བྱུག་མ་མཆིས།
en: A second child said: “ ‘We don’t have flowers, Perfumes, powders, or ointments.

source: །འཇིག་རྟེན་གང་ཟག་ཟླ་མེད་པ། །འདི་ལ་ཅིས་ནི་མཆོད་པར་བགྱི།
en: How could we venerate This being, who is unmatched in all the world?’ “

source: །དེ་ནས་ཁྱེའུ་དེས་མུ་ཏིག་གི་སེ་མོ་དོ་རིན་བརྒྱ་སྟོང་རི་བ་ལག་པ་གཡས་པས་མགུལ་ནས་བཀྲོལ་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །བསོད་ནམས་ཞིང་ནི་བླ་ན་མེད། །དེ་ལ་འདིས་ནི་མཆོད་པར་བགྱི།
en: The first child then took a pearl necklace of great value from his neck with his right hand and spoke the following verse: “ ‘I shall venerate this unsurpassed merit field With my necklace.

source: །འདི་མཐོང་ནས་ནི་མཁས་པ་དག །དངོས་པོ་དག་ལ་སུ་ཞིག་ཆགས།
en: Seeing what I’ve seen, what wise person Could be attached to such things?’ “

source: །དེ་ནས་ཤཱ་རིའི་བུ་ཁྱེའུ་གཉིས་པོ་དེ་དག་ཁྱེའུ་དེའི་རྗེས་སུ་སློབ་པར་གྱུར་ནས་བདག་བདག་གི་མགུལ་ནས་མུ་ཏིག་གི་སེ་མོ་དོ་བཀྲོལ་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །ཡང་དག་རྫོགས་པ་འོད་པ་རྒལ། །མྱ་ངན་སྤངས་པ་སེམས་གྲོལ་བ།
en: Śāriputra, the other two children then followed the first and took the pearl necklaces from their necks and spoke the following verse: “ ‘This perfect one, who has crossed to the other side, Has eliminated his anguish and liberated his mind.

source: །སྡིག་མེད་ཡང་དག་ཆོས་གནས་ལ།
en: He commits no evil and is a source of the genuine Dharma.

source: །བདག་ཅག་གཉིས་ནི་མཆོད་པ་བགྱིད།
en: To him, we shall make this offering.’ “

source: །དེ་ནས་ཁྱེའུ་དེས་ཁྱེའུ་གཉིས་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེའུ་ཁྱེད་གཉིས་སྦྱིན་པའི་ཆོས་འདིས་ཅིར་སྨོན།
en: The first child then asked the other two, ‘What do you two aspire to with this gift?’ “

source: དེ་ནས་ཁྱེའུ་གཅིག་གིས་སྨྲས་པ། བདག་ནི་བཅོམ་ལྡན་འདས་འདིའི་གཡས་ཕྱོགས་ན་ཤེས་རབ་དང་ལྡན་པའི་མཆོག་དེ་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཅིག །
en: One child said, ‘May I become like the one who is greatest in insight to the right of the Blessed One.’ “

source: ཁྱེའུ་གཉིས་པས་སྨྲས་པ། བདག་ནི་བཅོམ་ལྡན་འདས་འདིའི་གཡོན་ཕྱོགས་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་དེ་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཅིག །
en: The other child said, ‘May I become like the one who is greatest in miraculous abilities to the left of the Blessed One.’ “

source: དེ་ནས་ཁྱེའུ་དེས་སྨྲས་པ། བདག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ། ཕྱོགས་ཐམས་ཅད་དུ་སྣང་བར་མཛད་པ། སེང་གེའི་འགྲོས་སུ་གཤེགས་པ།
en: The first child then said, ‘May I become like the thus-gone, worthy, perfect Buddha, who knows all and sees all, who illuminates all directions, and who moves with the gait of a lion.’ “

source: འདི་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གྱུར་ཅིག་ཅེས་ཤཱ་རིའི་བུ་ཁྱེའུ་དེས་ཚིག་དེ་སྐད་སྨྲས་མ་ཐག་ཏུ་བར་སྣང་ལས་ལྷའི་བུ་བརྒྱད་སྟོང་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Śāriputra, as soon as the children said this, eight thousand gods called out from the sky, ‘Excellent!

source: ལེགས་སོ་ལེགས་སོ།
en: Excellent!

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཚིག་དེ་ལེགས་པར་སྨྲས་སོ།
en: Sublime being, your words were well spoken!’

source: །ལྷ་དང་འཇིག་རྟེན་དུ་བཅས་པའི་རྟེན་དུ་སེམས་བསྐྱེད་དོ།
en: Thus, the mind of awakening was developed in the world and among the gods. “

source: །དེ་ནས་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པས་བསྙེན་བཀུར་བྱེད་པ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་ལ་བཀའ་སྩལ་པ། དགེ་སློང་ཁྱོད་ཀྱིས་ཁྱེའུ་མུ་ཏིག་གི་སེ་མོ་དོ་ཐོགས་ཏེ། འོང་བ་འདི་གསུམ་མཐོང་ངམ། གསོལ་པ།
en: Śāriputra, the thus-gone He Who Outshines All then asked his servant Sāgaramati, ‘Monk, do you see the three children who are approaching bearing pearl necklaces?’ “

source: བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: He replied, ‘Blessed One, I do.’ “

source: དགེ་སློང་ཁྱེའུ་བར་མ་ཚུར་འོང་བ་འདི་ནི་འདི་འདྲ་བའི་བསམ་པས་འོང་སྟེ། གོམ་པ་འདོར་བ་དང་། འཇོག་པ་ཐམས་ཅད་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་བརྒྱ་སྟོང་གི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་ལེན་ཏོ། །དེ་བཞིན་དུ་བརྒྱ་བྱིན་འཐོབ་པ་དང་། ཚངས་པ་འཐོབ་པ་བརྒྱ་སྟོང་ཡོངས་སུ་ལེན་ཏོ།
en: The Blessed One continued, ‘The child in the middle is approaching with the following intention: for every step he takes forward, he will receive the roots of virtue for one hundred thousand realms of a universal monarch and likewise the roots of virtue for thousands of lifetimes as Śakra or Brahmā.

source: །གོམ་པ་ཐམས་ཅད་ལ་སངས་རྒྱས་བརྒྱ་སྟོང་མངོན་པར་མཐོང་བའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་ལེན་ཏོ།
en: For every step, he will receive the roots of virtue for beholding one hundred thousand buddhas.’ “

source: །ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་གསུམ་པོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་།
en: Śāriputra, the three children arrived before the blessed thus-gone He Who Outshines All and bowed their heads to his feet.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་མུ་ཏིག་གི་སེ་མོ་དོ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གཏོར་ཏོ།
en: They then tossed the pearl necklaces toward the Blessed One’s body.

source: །ཤཱ་རིའི་བུ་དེའི་ཚེ་གང་ཉན་ཐོས་ཀྱི་སེམས་ཀྱིས་མུ་ཏིག་གི་སེ་མོ་དོ་གཏོར་བར་གྱུར་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དེའི་ཕྲག་པ་གཉིས་ལ་འདུག་པར་གྱུར་ཏོ།
en: At that moment, Śāriputra, the pearl necklaces tossed by the children with the intention to become hearers landed upon the Blessed One’s shoulders.

source: །གང་ཁྱེའུ་དེས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱིས་མུ་ཏིག་གི་སེ་མོ་དོ་གཏོར་བར་གྱུར་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དེའི་དབུའི་གཙུག་གི་སྟེང་ན་མུ་ཏིག་གི་སེ་མོ་དོའི་ཁང་པ་བརྩེགས་མ་རྣམ་པ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ། གྲུ་བཞི་པ། ཀ་བ་བཞི་ཟུག་པ། ཀུན་ནས་རྣམ་པར་ཕྱེ་བར་གྱུར་ཅིང་།
en: The pearl necklace tossed by the child with the intention to gain omniscience, however, transformed above the crown of the Thus-Gone One into a multistory mansion that was of a fine design and beautiful to behold, with four sides and four columns and well proportioned.

source: ཁང་པ་བརྩེགས་མ་དེ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཤིང་བཞུགས་པར་ཡང་སྣང་ངོ་།
en: In the mansion sat the form of the Thus-Gone One in cross-legged posture. “

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་འཛུམ་པ་མཛད་དེ།
en: At this, the Thus-Gone One smiled.

source: ཆོས་ཉིད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནམ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་པ་དུ་མ་དེ་བཞིན་གཤེགས་པའི་ཞལ་ནས་འབྱུང་སྟེ། འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: It is the nature of things that when a blessed buddha smiles, variegated light streams forth from the Thus-Gone One’s mouth in the colors of blue, yellow, red, white, green, crystalline, and silver.

source: དཀར་པོ་དང་། ཇ་གོང་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་དག་གོ། །དེ་དག་གི་སྣང་བས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ།
en: The light pervaded limitless and boundless worlds as far as the Brahmā world.

source: ཉི་མ་དང་ཟླ་བའི་འོད་ཟིལ་གྱིས་མནན་ནས་སླར་ལོག་སྟེ།
en: It outshone the light of the sun and moon and then returned.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་བོར་མི་སྣང་བར་སོང་ངོ་།
en: Encircling the Blessed One three times, the light disappeared into the Blessed One’s crown. “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྙེན་བཀུར་བྱེད་པ་དགེ་སློང་བློ་གྲོས་རྒྱ་མཚོས་ཞུས་པ། དེ་བཞིན་གཤེགས་པ་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་ནི་འཛུམ་པ་མི་མཛད་ན།
en: The Blessed One’s servant Sāgaramati then asked him, ‘The Thus-Gone One does not smile without cause or reason.

source: བཅོམ་ལྡན་འདས་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་འཛུམ་པ་མཛད་ཅེས་དེ་སྐད་གསོལ་པ་དང་།
en: Hence, Blessed One, what was the cause and reason for your smile?’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བསྙེན་བཀུར་བྱེད་པ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགེ་སློང་ཁྱེའུ་འདི་གཉིས་ཀྱིས་ཉན་ཐོས་ཀྱི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མུ་ཏིག་གི་སེ་མོ་དོ་གཉིས་གཏོར་བ་ཁྱོད་ཀྱིས་མཐོང་ངམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ངོ་།
en: The Blessed One answered his servant, ‘Monk, do you see these two children who tossed pearl necklaces toward the Thus-Gone One with the intention to become hearers?’ “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: ‘Blessed One, I do.’ “

source: དགེ་སློང་ཁྱེའུ་འདི་གཉིས་ནི་འཁོར་བས་འཇིགས་སྐྲག་ནས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་མི་འདེབས་པར་བདག་ཅག་ནི་མྱུར་དུ་མྱ་ངན་ལས་འདས་པར་བྱའོ་སྙམ་དུ་དེ་ལྟར་སེམས་སོ།
en: The Blessed One continued, ‘Monk, these two children wished to swiftly reach nirvāṇa because of fearing saṃsāra rather than aspiring to awakening.

source: །དགེ་སློང་ཁྱོད་ལ་བསྒོའོ། །ཁོང་དུ་ཆུད་པར་བྱའོ།
en: Monk, I instruct you, so you should understand this.

source: །གང་གི་ཚེ་ན་ཁྱེའུ་གསུམ་པ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་འགྱུར་བ་དེའི་ཚེ། ཁྱེའུ་འདི་གཉིས་ནི་དེའི་ཉན་ཐོས་ཀྱི་མཆོག་ཏུ་འགྱུར་ཏེ།
en: When the third child fully awakens to unsurpassed and perfect buddhahood, these two other children will be the greatest of his hearers.

source: གཅིག་ནི་ཤེས་རབ་དང་ལྡན་པའི་མཆོག །གཉིས་པ་ནི་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་འགྱུར་རོ།
en: One will be the greatest in terms of insight, and the other will be the greatest in terms of miraculous abilities.’ “

source: །ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་བར་མར་གྱུར་ཅིང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པ་དེ་ནི་གཞན་ནོ་སྙམ་དུ་ཐེ་ཙོམ་མམ། ཡིད་གཉིས་སུ་གྱུར་པར་ཤཱ་རིའི་བུ་དེ་ལྟར་མ་ལྟ་ཞིག །
en: Śāriputra if you are doubting or considering that the child in the middle, who developed the intention to gain omniscience, is someone unknown to you, do not do that.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་བར་མ་དེར་གྱུར་ཏོ།
en: I myself, at that time, was the child in the middle.

source: །ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་གཡས་ཕྱོགས་ཀྱི་ཁྱེའུར་གྱུར་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་དེ་ལྟར་མ་ལྟ་ཞིག །
en: Śāriputra, if you are imagining that the child on the right is someone unknown to you, do not do that.

source: ཤཱ་རིའི་བུ་ཁྱོད་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཁྱེའུ་དེར་གྱུར་ཏོ། །དགེ་སློང་མཽང་གལ་གྱི་བུ་ནི་ཁྱེའུ་གཡོན་ཕྱོགས་པར་གྱུར་ཏོ།
en: Śāriputra, it was you who were at that time the child on the right, and the monk Maudgalyāyana was the child on the left.

source: །ཤཱ་རིའི་བུ་ལྟོས་དགེ་བའི་རྩ་བ་མཉམ་པ་ལས་ཁྱེད་གཉིས་འཁོར་བས་འཇིགས་སྐྲག་ནས་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་དེ་སེམས་ཞུམ་པས་ཅི་ནས་ཀྱང་བདག་ཅག་གིས་མྱུར་དུ་མྱ་ངན་ལས་འདའ་བར་བྱའོ་སྙམ་བྱེད་མོད་ཀྱི་ཁྱེད་གཉིས་ཀྱིས་ང་ལས་ཐལ་བར་མ་ནུས་སོ།
en: Śāriputra, consider this: although we had the same roots of virtue, the two of you were afraid of saṃsāra and so did not develop the mind of awakening. With such timidity, you thought, ‘We must reach nirvāṇa as swiftly as possible, by any means necessary.’ Just by this thought, the two of you did not surpass me.

source: །ཤཱ་རིའི་བུ་ལྟོས་ངས་ཐམས་ཅད་མཁྱེན་པ་རྟོགས་ནས་ཁྱེད་གཉིས་ནི་ངས་ཆོས་བསྟན་པས་རྣམ་པར་གྲོལ་ལོ།
en: Śāriputra, consider this: since I have realized omniscience, I can instruct the two of you in the Dharma, leading to your freedom.

source: །ཤཱ་རིའི་བུ་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་ཤེས་པར་བྱ་སྟེ་ཅི་ནས་ཀྱང་མྱུར་དུ་མྱ་ངན་ལས་འདའ་བར་འདོད་ན་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པར་བྱའོ།
en: Śāriputra, from this lesson, you should understand that if you wish to swiftly reach nirvāṇa, you should develop the intention to gain omniscience.

source: ཤཱ་རིའི་བུ་མྱུར་བའི་ཐེག་པ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཚིག་བླ་དགས་སོ། །མི་སླུ་བའི་ཐེག་པ་ཞེས་བྱ་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཐེག་པ་ཞེས་བྱ་བ། འབར་བའི་ཐེག་པ་ཞེས་བྱ་བ། ཐེག་པའི་མཆོག་ཅེས་བྱ་བ།
en: Śāriputra, the swift vehicle is a synonym for omniscience.

source: ཐེག་པའི་གཙོ་བོ་ཞེས་བྱ་བ། ཐེག་པ་རབ་མཆོག་ཅེས་བྱ་བ། བླ་ན་མེད་པའི་ཐེག་པ་ཞེས་བྱ་བ། མ་ཆགས་པའི་ཐེག་པ་ཞེས་བྱ་བ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པའི་ཐེག་པ་ཞེས་བྱ་བ་ནི་ཤཱ་རིའི་བུ་ཐམས་ཅད་མཁྱེན་པའི་ཚིག་བླ་དགས་སོ།
en: The undeceiving vehicle, the vehicle that brings all beings benefit and happiness, the radiant vehicle, the sublime vehicle, the primary vehicle, the supreme vehicle, the unsurpassed vehicle, the unobstructed vehicle, and the vehicle that outshines all hearers and solitary buddhas are synonyms, Śāriputra, for omniscience.”

source: །སྔོན་བྱུང་བའི་གཏམ་འདི་དང་། ཐམས་ཅད་མཁྱེན་པ་སྟོན་པ་འདི་བསྟན་པའི་ཚེ་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ཤཱ་རིའི་བུ་དང་། མཽང་གལ་གྱི་བུ་ཆེན་པོ་དང་། འོད་སྲུང་ཆེན་པོ་དང་། རེ་བ་ཏི་དང་། མ་འགགས་པ་དང་།
en: When this story from the past and this teaching about omniscience were given, ten thousand beings developed the mind directed toward unsurpassed and perfect awakening.

source: ཨུ་པ་ལི་དང་། བྱམས་མའི་བུ་གང་པོ་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་མགྲིན་གཅིག་ཏུ་ཚིག་སྨྲས་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོས་གུས་པར་བགྱིས་ཏེ། དགེ་བའི་རྩ་བ་བསྐྱེད་པར་བགྱིའོ།
en: Śāriputra, Mahāmaudgalyāyana, Mahākāśyapa, Revata, Aniruddha, Upāli, Pūrṇa Maitrāyaṇīputra, and all the other great hearers prostrated to the Blessed One and said with one voice, “Blessed One, noble sons and daughters should respectfully generate roots of virtue.

source: །རྒྱ་ཆེན་པོ་ལ་ཡང་མོས་པར་བགྱིའོ།
en: They should aspire to vastness.

source: །སྨོན་ལམ་རྒྱ་ཆེན་པོ་ཡང་གདབ་པར་བགྱིའོ།
en: They should forge great aspirations.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this?

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་སངས་རྒྱས་བརྒྱ་སྟོང་གིས་ཐམས་ཅད་མཁྱེན་པ་དང་ལྡན་པའི་གཏམ་བརྗོད་ཅིང་བདག་ཅག་ལ་ཆོས་བསྟན་ཀྱང་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་མ་ཆགས་པའི་ཡེ་ཤེས་རྟོགས་པར་འགྱུར་བའི་སྐལ་བ་མ་མཆིས་སོ།
en: Blessed One, even though hundreds of thousands of buddhas have delivered talks on omniscience to us and taught us the Dharma, we have not had the fortune to realize unobstructed wisdom.
